In [116]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random .choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis_kelamin kelas
0         1     Biologi     63     perempuan   12B
1         2     Ekonomi     11     perempuan   12C
2         3  Matematika     34     laki-laki   12D
3         4  Matematika     16     laki-laki   12B
4         5     Geologi      4     perempuan   12B

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [131]:
print(df.loc[3 , 'kelas'])
print(df.loc[5,'pelajaran'])

12B
Geologi

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [119]:
#1 
eko = df.pelajaran =="Ekonomi"
fis = df.pelajaran =="Fisika"
df[(eko | fis)]

    siswa_id pelajaran  nilai jenis_kelamin kelas
1          2   Ekonomi     11     perempuan   12C
8          9    Fisika     25     perempuan   12A
9         10   Ekonomi     37     perempuan   12D
12        13   Ekonomi     40     laki-laki   12B
17        18   Ekonomi     37     laki-laki   12D
18        19    Fisika     71     perempuan   12A

In [120]:
#2 
n = df.nilai > 50 
kim = df.pelajaran=="Kimia" 
df[(n) & (kim) ]

    siswa_id pelajaran  nilai jenis_kelamin kelas
15        16     Kimia     67     perempuan   12C
19        20     Kimia     81     perempuan   12A

In [121]:
#3 
nilai_70 = df.nilai > 70 
women = df.jenis_kelamin =='perempuan' 
kelas = df.kelas == '12C'
df[(nilai_70) & (women) & (kelas)]

    siswa_id   pelajaran  nilai jenis_kelamin kelas
10        11  Matematika     73     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [137]:
def minus_minimum(nilai):
    return nilai - nilai.min() 
transform = df[['nilai']].apply(minus_minimum)
selisih = nilai.max() - nilai.min() 
x_norm = transform/selisih 
print(x_norm)

       nilai
0   0.621053
1   0.073684
2   0.315789
3   0.126316
4   0.000000
5   0.221053
6   0.094737
7   0.852632
8   0.221053
9   0.347368
10  0.726316
11  0.105263
12  0.378947
13  0.589474
14  0.463158
15  0.663158
16  0.410526
17  0.347368
18  0.705263
19  0.810526